#+title: Implement a Virtual Memory in Python
#+author: Chunwei Yan
#+subtitle:
#+date: 2024-11-01
#+hugo_tags: "os"
#+hugo_draft: true
#+toc: nil

** A centric config class for all the options for Virtual Memory
Let's have a central config to align with the algorithm.

#+BEGIN_SRC python :session vm
# The settings for Virtual Memory
@dataclass
class VMConfig:
    num_pages: int = 256
    page_size: int = 4096 # byte

    num_frames: int = 256

    physical_memory_size: int = 4096 * 256
    swap_size: int = 4096 * 246

    @property
    def frame_size(self) -> int:
        return self.page_size
#+END_SRC

#+RESULTS:
: None
: None
: None

** Page class for virtual memory page

The state of the Page:

#+BEGIN_SRC python :session vm
class PageState(Enum):
    # The page is cached in physical memory
    cached = 0
    # The page is not cached in physical memory
    uncached = 1
    # The page is not allocated
    unallocated = 2
#+END_SRC

#+RESULTS:
: None
: None
: None

The class for a virtual memory page:

#+BEGIN_SRC python :session vm
@dataclass
class Page:
    ''' A virtual page '''
    state: PageState
    # The address of the page in the physical memory, either phisical page number or address in disk or None
    address: Optional[int] = None

    # The size of the continuous Pages for an allocated memory
    # Only the first page of the continuous pages has this value
    allocated_page_num : Optional[int] = None
#+END_SRC

#+RESULTS:
: None
: None

The ~address~ is an integer, if the ~state~ is ~cached~, then it points to an pointer in RAM, while if it is ~uncached~, it points to disk instead. The ~allocation_size~ is the size of an VM allocation, only the first Page has the value, it is assigned when allocating the virtual memory, and is used to denote how many pages belong to this allocation when deallocating the memory, e.g. like C language, passing in  ~free(mem_addr)~ rather than ~free(mem_addr, allocation_size)~, we don't want user code to record the ~allocation_size~ for each ~mem_addr~.

** PageTable class
The PageTable is a container of all the ~Page~ instances, it also contains the logic of locating the Page mapped to an address and other utilities.

#+BEGIN_SRC python :session vm
class PageTable:
    def __init__(self, num_pages:int, page_size:int):
        self.num_pages = num_pages
        self.page_size = page_size
        self.table = [None] * self.page_count

    def get_page(self, page_id:int) -> Page:
        assert page_id < self.page_count
        return self.table[page_id]

    def get_page_for_address(self, address: int) -> Page:
        page_id = address // self.page_size
        assert page_id < self.page_count
        return self.table[page_id]

    def set_swap_frame(self, page_id:int, swap_offset:int):
        self.table[page_id] = Page(state=PageState.uncached, address=swap_offset)

    def set_memory_frame(self, page_id:int, memory_offset:int):
        self.table[page_id] = Page(state=PageState.cached, address=memory_offset)

    def free_page(self, page_id:int):
        self.table[page_id] = None
#+END_SRC

#+RESULTS:
: None
: None
: None
: None

** SwapAllocator
The ~SwapAllocator~ is used for manaing the Swap space in SSD or Disk. It will occupies a large buffer, and assign ~Frame~ for a VM allocation.

#+BEGIN_SRC python :session vm :results output
class SwapAllocator(BufferAllocator):
    def __init__(self, config: VMConfig):
        super().__init__(config.swap_size, config.frame_size)
        self.config = config
        self.swap_file_path = tempfile.mkstemp()[1]
        self.init_buffer()

    def init_buffer(self):
        # Create the swap file as an buffer
        self.buffer = open(self.swap_file_path, 'r+b')
        self.buffer.seek(self.config.swap_size - 1)
        self.buffer.write(b'\0')

    def write_frame(self, frame_id:int, data:bytes):
        self.buffer.seek(frame_id * self.config.frame_size)
        self.buffer.write(data)

    def read_frame(self, frame_id:int):
        self.buffer.seek(frame_id * self.config.frame_size)
        return self.buffer.read(self.config.frame_size)

    def __del__(self):
        self.buffer.close()
        # remove the file
        os.remove(self.swap_file_path)
#+END_SRC

#+RESULTS:

The ~free_frames~ is a naive implementation for locating the next free ~Frame~, or we need to introduce some allocator algorithm such as [[https://en.wikipedia.org/wiki/Buddy_memory_allocation][Buddy Memory Allocation]], that is overkill for an example.

Let's try it with a tiny buffer.

#+BEGIN_SRC python :session vm :results output
def test_swap_allocator():
    config = VMConfig()
    config.swap_size = 1024 # byte
    config.page_size = 64 # byte

    swap_allocator = SwapAllocator(config)
    frame_ids = swap_allocator.allocate(512)
    assert len(frame_ids) == 512 / 64
    swap_allocator.write_frame(frame_ids[0], b'1'*64)
    assert swap_allocator.read_frame(frame_ids[0]) == b'1'*64

test_swap_allocator()
#+END_SRC

#+RESULTS:
: frames: 16

** PhysicalMemoryAllocator
Similarly, the ~PhysicalMemoryAllocator~ is an inherience of ~BufferAllocator~.


#+BEGIN_SRC python :session vm :results output
class PhysicalAllocator(BufferAllocator):
    def __init__(self, config: VMConfig):
        super().__init__(config.memory_size, config.page_size)
        self.config = config
        self.init()

    def init(self):
        self.buffer = bytearray(self.config.memory_size)

    def write_frame(self, frame_id:int, data: bytes):
        frame_start = frame_id * self.config.page_size
        self.buffer[frame_start:frame_start + len(data)] = data

    def read_frame(self, frame_id:int) -> bytes:
        frame_start = frame_id * self.config.page_size
        return self.buffer[frame_start:frame_start + self.config.page_size]
#+END_SRC

#+RESULTS:

Let's try it:


#+BEGIN_SRC python :session vm :results output
def test_PhysicalAllocator():
    config = VMConfig()
    config.memory_size = 1024
    config.page_size = 64

    allocator = PhysicalAllocator(config)
    frame_ids = allocator.allocate(512)
    print(frame_ids)
    assert len(frame_ids) == 512 // config.page_size
    allocator.write_frame(frame_ids[0], b'hello')
    assert allocator.read_frame(frame_ids[0])[: len(b'hello')] == b'hello', f"expected 'hello' but got {allocator.read_frame(frame_ids[0])}"

test_PhysicalAllocator()
#+END_SRC

#+RESULTS:
: frames: 16
: [0, 1, 2, 3, 4, 5, 6, 7]


